; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	image1 - mode
	infrared0 - mode
	spectrograph2 - mode
	Star2 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument1 spectrograph2)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument4 image1)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star5)
	(supports instrument6 infrared0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star11)
)
(:goal (and
	(pointing satellite1 Planet7)
	(pointing satellite3 Star12)
	(have_image Phenomenon6 image1)
	(have_image Planet7 spectrograph2)
	(have_image Star8 spectrograph2)
	(have_image Planet9 image1)
	(have_image Star10 infrared0)
	(have_image Star11 image1)
	(have_image Star12 infrared0)
))

)

; plan
1. (turn_to satellite3 star12 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star12)
   goals met: 1 of 9
2. (turn_to satellite1 star2 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star2)
   goals met: 1 of 9
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 9
4. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 1 of 9
5. (turn_to satellite1 star10 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star10)
   goals met: 1 of 9
6. (take_image satellite1 star10 instrument1 infrared0)
   added: (have_image star10 infrared0)
   goals met: 2 of 9
7. (turn_to satellite1 planet9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet9)
   goals met: 2 of 9
8. (take_image satellite1 planet9 instrument1 image1)
   added: (have_image planet9 image1)
   goals met: 3 of 9
9. (turn_to satellite1 phenomenon6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   goals met: 4 of 9
11. (turn_to satellite1 star11 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star11)
   goals met: 4 of 9
12. (take_image satellite1 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 5 of 9
13. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 5 of 9
14. (take_image satellite1 star12 instrument1 infrared0)
   added: (have_image star12 infrared0)
   goals met: 6 of 9
15. (turn_to satellite1 star8 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star8)
   goals met: 6 of 9
16. (take_image satellite1 star8 instrument1 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 7 of 9
17. (turn_to satellite1 planet7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet7)
   goals met: 8 of 9
18. (take_image satellite1 planet7 instrument1 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 9 of 9
